hw3/report.tex
% Created 2021-12-12 Sun 22:10
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\documentclass{article}
\usepackage{here}
\usepackage{xcolor}
\usepackage{amsmath}
\usepackage{parskip}
\renewcommand\arraystretch{1.4}
\usepackage[margin=1in]{geometry}
\usepackage{minted}
\usepackage{multicol}
\definecolor{bg}{rgb}{0.95,0.95,0.95}
\newminted{c}{fontsize=\footnotesize,frame=single,framesep=2mm}
\usepackage[demo]{graphicx}
\usepackage{subcaption}
\usepackage{caption}
\DeclareCaptionFormat{empty}{}
\captionsetup[subfigure]{labelformat=empty}
\newminted{text}{breaklines,fontsize=\footnotesize,frame=single,framesep=2mm}
\author{Fatih Kaan Salgır - 171044009}
\date{}
\title{CSE464 - Digital Image Processing - HW3}
\hypersetup{
 pdfauthor={Fatih Kaan Salgır - 171044009},
 pdftitle={CSE464 - Digital Image Processing - HW3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Exercise 1}
\label{sec:orgdaf0ed6}

Ordering relation shall be related to the data the image represents.
In grayscale images, a pixel value (an integer) represents the light of intensity, and the pixels can be ordered by comparing the integers.
If a pixel value is a real vector, the pixel value may represent the intensity of light at a range of wavelengths.

Assume that the ordering relation is used to identify a material.
If the remission rate of a material is known in a certain wavelength, the ordering relation can be sensitive to that wavelength.
Since what the image represents and the purpose of the ordering is unknown, more general ordering relations are used.

\subsection*{a)}
\label{sec:orgcdbddf1}

Ordering relation used is ``the norm of the vector less than or equal to''.

2D images where each pixel is a vector,
\begin{flalign*}
& f: \mathbb{Z}^{2} \to v_1, \dots, v_n \in \Bbb R^n, \dim(v_i) > 2 &
\end{flalign*}
and the ordering relation is defined as,
\begin{flalign*}
& \forall i,j \in v_1, \dots, v_n \in \Bbb R^n,  i \le j \iff \|\vc{i}\| \le \|\vc{j}\| & \\
& \forall i,j \in v_1, \dots, v_n \in \Bbb R^n, \|\vc{j}\| \le \|\vc{i}\| $ or $ \|\vc{i}\| \le \|\vc{j}\| $ (total ordering)$ &
\end{flalign*}


\subsection*{b)}
\label{sec:org68d821c}

Ordering relation used is ``the determinant of the matris less than or equal to''.

2D images where each pixel is a square matrix,
\begin{flalign*}
& f: \mathbb{Z}^{2} \to \mathbb{R}^{n \times n} &
\end{flalign*}
and the ordering relation is defined as,
\begin{flalign*}
& \forall A,B \in \mathbb{R}^{n \times n}, A \le B \iff \det(A) \le \det(B) & \\
& \forall A,B \in \mathbb{R}^{n \times n},
\det(A) \le \det(B)
$ or $
\det(B) \le \det(A) $ (total ordering)$ &
\end{flalign*}

\subsection*{c)}
\label{sec:orgdefdd58}

Ordering relation used is ``the squared sum of elements in the tensor less than or equal to''.

2D images where each pixel is a 3rd order tensor,
\begin{flalign*}
& f: \mathbb{Z}^{2} \to A \in \mathbb{R}^{I \times J \times K} &
\end{flalign*}
and the ordering relation is defined as,
\begin{flalign*}
& \forall A,B \in \mathbb{R}^{I \times J \times K}, A \le B
\iff
\sum_{i=1}^{I}
\sum_{j=1}^{J}
\sum_{k=1}^{K}
a_{ijk}^2
\le
\sum_{i=1}^{I}
\sum_{j=1}^{J}
\sum_{k=1}^{K}
b_{ijk}^2
& \\
& \forall A,B \in \mathbb{R}^{I \times J \times K}, A \le B,
\sum_{i=1}^{I}
\sum_{j=1}^{J}
\sum_{k=1}^{K}
a_{ijk}^2
\le
\sum_{i=1}^{I}
\sum_{j=1}^{J}
\sum_{k=1}^{K}
b_{ijk}^2
\textrm{ or }
\sum_{i=1}^{I}
\sum_{j=1}^{J}
\sum_{k=1}^{K}
b_{ijk}^2
\le
\sum_{i=1}^{I}
\sum_{j=1}^{J}
\sum_{k=1}^{K}
a_{ijk}^2 &
\end{flalign*}



\section*{Excercise 2}
\label{sec:orge34e930}

In mathematical morphology, noise reduction can be achieved by performing opening and closing sequences on the image.
Opening decreases sizes of small bright details (noises), with no effect on the darker areas.

If total ordering is used, then all pixel values or vectors must be comparable.
That means maximum and minimum values can always be found in a given set of values.
Therefore scalar ordering should be used e.g. magnitude of a vector.
That is the direction of the vector is ignored.
This results in more strict noise reduction and possibly removes the details of the image along with the noise.

If partial ordering is used, such as product order which is given two paris (\(a_1, b_1\)) and (\(a_2, b_2\)) in \(A \times B\), \((a_1, b_1) \le (a_2, b_2)\) if and only if \(a_1 \le a_2\) and \(b_1 \le b_2\), only limited number of values are comparable. This leads to less strict noise reduction.

Depending on the image partial order might be a better choice since it uses more information.
\end{document}
